In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1, inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
# from sklearn.preprocessing import LabelEncoder
# le = LabelEncoder()

In [5]:
# df.Sex = le.fit_transform(df.Sex)

In [6]:
dummy = pd.get_dummies(df.Sex)

In [7]:
df = pd.concat([df,dummy], axis=1)

In [8]:
df.head()

   Pclass     Sex   Age     Fare  Survived  female  male
0       3    male  22.0   7.2500         0       0     1
1       1  female  38.0  71.2833         1       1     0
2       3  female  26.0   7.9250         1       1     0
3       1  female  35.0  53.1000         1       1     0
4       3    male  35.0   8.0500         0       0     1

In [9]:
df.isnull().any()

Pclass      False
Sex         False
Age          True
Fare        False
Survived    False
female      False
male        False
dtype: bool

In [10]:
df.Age.isnull().sum()

177

In [11]:
df.Age = df.Age.fillna(round(df.Age.mean()))

In [12]:
X = df.drop(['Survived','Sex'], axis = 1)
X.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [13]:
y = df.Survived
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [14]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.25)

# Gaussian

In [15]:
from sklearn.naive_bayes import GaussianNB
gnb = GaussianNB()

In [16]:
gnb.fit(X_train, y_train)

GaussianNB()

In [17]:
gnb.score(X_test, y_test)

0.7668161434977578

# Multinomial

In [18]:
from sklearn.naive_bayes import MultinomialNB
mnb = MultinomialNB()

In [19]:
mnb.fit(X_train, y_train)

MultinomialNB()

In [20]:
mnb.score(X_test, y_test)

0.6860986547085202

# Bernoulli

In [21]:
from sklearn.naive_bayes import BernoulliNB
bnb = BernoulliNB()

In [22]:
bnb.fit(X_train, y_train)

BernoulliNB()

In [23]:
bnb.score(X_test, y_test)

0.7713004484304933